# Lecture 6

Data Science, Fall 2023



A demonstration of exploratory data analysis to accompany Lecture 6 (originally planned for Lecture 5).

In [103]:
import numpy as np
import pandas as pd

In [104]:
import matplotlib.pyplot as plt
import seaborn as sns
#%matplotlib inline
plt.rcParams['figure.figsize'] = (12, 9)

sns.set()
sns.set_context('talk')

np.set_printoptions(threshold=20, precision=2, suppress=True)
pd.set_option('display.max_rows', 30)
pd.set_option('display.max_columns',7)
pd.set_option('display.precision', 2)
# This option stops scientific notation for pandas
pd.set_option('display.float_format', '{:.2f}'.format)

These options are used to customize the display of pandas DataFrames for better readability and precision when working with data. Here's why each option is helpful:

# Tuberculosis in the United States

What can we say about the presence of Tuberculosis in the United States?

Let's look at the data included in the [original CDC article](https://www.cdc.gov/mmwr/volumes/71/wr/mm7112a1.htm?s_cid=mm7112a1_w#T1_down) published in 2021.

<br/>

---

# CSV and Nice Field Names
Suppose Table 1 was saved as a CSV file located in `data/cdc_tuberculosis.csv`.

We can then explore the CSV (which is a text file, and does not contain binary-encoded data) in many ways:
1. Using a text editor like the one in DataHub (right-click on the file and use `Open->Editor`), emacs, vim, VSCode, etc.
2. Opening the CSV directly in DataHub (read-only), Excel, Google Sheets, etc.
3. The Python file object
4. pandas, using `pd.read_csv()`

1, 2. Let's start with the first two so we really solidify the idea of a CSV as **rectangular data (i.e., tabular data) stored as comma-separated values**.



4. Finally, let's see the tried-and-true Data Science approach: pandas.

In [105]:
# Read tuberculosis data

tuber_data = pd.read_csv("H:\Machine Learning\EDA\cdc_tuberculosis.csv",thousands=',',header=1)
tuber_data.head(2)

  U.S. jurisdiction  2019  2020  2021  2019.1  2020.1  2021.1
0             Total  8900  7173  7860    2.71    2.16    2.37
1           Alabama    87    72    92    1.77    1.43    1.83

Wait, what's up with the "Unnamed" column names? And the first row, for that matter?

Congratulations -- you're ready to wrangle your data. Because of how things are stored, we'll need to clean the data a bit to name our columns better.

A reasonable first step is to identify the row with the right header. The `pd.read_csv()` function ([documentation](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html)) has the convenient `header` parameter:

In [106]:
# Answer Here

tuber_data = pd.read_csv("H:\Machine Learning\EDA\cdc_tuberculosis.csv",thousands=',',header=1)
tuber_data.head(2)

  U.S. jurisdiction  2019  2020  2021  2019.1  2020.1  2021.1
0             Total  8900  7173  7860    2.71    2.16    2.37
1           Alabama    87    72    92    1.77    1.43    1.83

Wait...but now we can't differentiate betwen the "Number of TB cases" and "TB incidence" year columns. pandas has tried to make our lives easier by automatically adding ".1" to the latter columns, but this doesn't help us as humans understand the data.

We can do this manually with `df.rename()` [documentation]

In [107]:
# Rename column List
tuber_data.columns = ['States','TB_cases(2019)','TB_cases(2020)','TB_cases(2021)','TB_inci(2019)','TB_inci(2020)','TB_inci(2021)']

In [108]:
tuber_data.head(2)

,States,TB_cases(2019),TB_cases(2020),TB_cases(2021),TB_inci(2019),TB_inci(2020),TB_inci(2021)
0,Total,8900,7173,7860,2.71,2.16,2.37
1,Alabama,87,72,92,1.77,1.43,1.83

<br/><br/>

---

# Record Granularity

You might already be wondering: What's up with that first record?

Row 0 is what we call a **rollup record**, or summary record. It's often useful when displaying tables to humans. The **granularity** of record 0 (Totals) vs the rest of the records (States) is different.

<br/>

Okay, EDA step two. How was the rollup record aggregated?

Let's check if Total TB cases is the sum of all state TB cases. If we sum over all rows, we should get **2x** the total cases in each of our TB cases by year (why?).

In [109]:
# Apply sum to tb DataFrame

tuber_data["Total_Cases"] = tuber_data[['TB_cases(2019)','TB_cases(2020)','TB_cases(2021)']].sum(axis=1)
tuber_data["Total_incidence"] = tuber_data[['TB_inci(2019)','TB_inci(2020)','TB_inci(2021)']].sum(axis=1)

In [110]:
tuber_data.head()

,States,TB_cases(2019),TB_cases(2020),...,TB_inci(2021),Total_Cases,Total_incidence
0,Total,8900,7173,...,2.37,23933,7.24
1,Alabama,87,72,...,1.83,251,5.03
2,Alaska,58,58,...,7.92,174,23.75
3,Arizona,183,136,...,1.77,448,6.17
4,Arkansas,64,59,...,2.28,192,6.36

<br/>

Whoa, what's going on? Check out the column types:

In [111]:
# Find datatype for each column
tuber_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   States           52 non-null     object
 1   TB_cases(2019)   52 non-null     int64
 2   TB_cases(2020)   52 non-null     int64
 3   TB_cases(2021)   52 non-null     int64
 4   TB_inci(2019)    52 non-null     float64
 5   TB_inci(2020)    52 non-null     float64
 6   TB_inci(2021)    52 non-null     float64
 7   Total_Cases      52 non-null     int64
 8   Total_incidence  52 non-null     float64
dtypes: float64(4), int64(4), object(1)
memory usage: 3.8+ KB

<br/>

Looks like those commas are causing all TB cases to be read as the `object` datatype, or **storage type** (close to the Python string datatype), so pandas is concatenating strings instead of adding integers.

<br/>

Fortunately `read_csv` also has a `thousands` parameter (for what it's worth, I didn't know this beforehand--I [googled](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html) this):

In [112]:
# improve readability: chaining method calls with outer parentheses/line breaks

# I performed this operation in the very first column while reading the dataframe

In [113]:
# now apply sum
# Answer Here


tuber_data["Total_Cases"] = tuber_data[['TB_cases(2019)','TB_cases(2020)','TB_cases(2021)']].sum(axis=1)
tuber_data["Total_incidence"] = tuber_data[['TB_inci(2019)','TB_inci(2020)','TB_inci(2021)']].sum(axis=1)

In [114]:
tuber_data.head()

,States,TB_cases(2019),TB_cases(2020),...,TB_inci(2021),Total_Cases,Total_incidence
0,Total,8900,7173,...,2.37,23933,7.24
1,Alabama,87,72,...,1.83,251,5.03
2,Alaska,58,58,...,7.92,174,23.75
3,Arizona,183,136,...,1.77,448,6.17
4,Arkansas,64,59,...,2.28,192,6.36

The Total TB cases look right. Phew!

(We'll leave it to your own EDA to figure out how the TB incidence "Totals" were aggregated.)

Let's just look at the records with **state-level granularity**:

In [115]:
# Answer Here
tuber_data.drop(0,axis=0,inplace=True)
tuber_data.head()

,States,TB_cases(2019),TB_cases(2020),...,TB_inci(2021),Total_Cases,Total_incidence
1,Alabama,87,72,...,1.83,251,5.03
2,Alaska,58,58,...,7.92,174,23.75
3,Arizona,183,136,...,1.77,448,6.17
4,Arkansas,64,59,...,2.28,192,6.36
5,California,2111,1706,...,4.46,5567,14.13

What do each of these values represent? Why?

To the lecture!


# Gather Census Data

U.S. Census population estimates [source](https://www.census.gov/data/tables/time-series/demo/popest/2010s-state-total.html) (2019), [source](https://www.census.gov/data/tables/time-series/demo/popest/2020s-state-total.html) (2020-2021).

Running the below cells cleans the data. We encourage you to closely explore the CSV and study these lines after lecture...

There are a few new methods here:
* `df.convert_dtypes()` ([documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.convert_dtypes.html)) conveniently converts all float dtypes into ints and is out of scope for the class.
* `df.drop_na()` ([documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.dropna.html)) will be explained in more detail next time.

In [134]:
# Load 2010s census data
# Answer Here

cen_data = pd.read_csv(r"H:\Machine Learning\EDA\nst-est2019-01.csv", header=3, thousands=",")
cen_data.head()

,Unnamed: 0,Census,Estimates Base,...,2017,2018,2019
0,United States,308745538.00,308758105.00,...,324985539.00,326687501.00,328239523.00
1,Northeast,55317240.00,55318443.00,...,56059240.00,56046620.00,55982803.00
2,Midwest,66927001.00,66929725.00,...,68126781.00,68236628.00,68329004.00
3,South,114555744.00,114563030.00,...,123542189.00,124569433.00,125580448.00
4,West,71945553.00,71946907.00,...,77257329.00,77834820.00,78347268.00

# Apply some EDA

Drop the column of Estiamte Base

Rename Unnamed: 0 as 'Geographic Area'

"smart" converting of columns, use at your own risk

.dropna() to drop records with NaN

You can also suggest any change that can be helpful for EDA

In [135]:

# with pd.option_context('display.min_rows', 30): # shows more rows
#     display(census_2010s_df)

cen_data = (
    cen_data
    .drop(columns=["Estimates Base"])
    .rename(columns={"Unnamed: 0": "Geographic Area"})
    .convert_dtypes()                
    .dropna()                   
)

In [136]:
# census 2020s data
cen_data.head(5)

  Geographic Area     Census       2010  ...       2017       2018       2019
0   United States  308745538  309321666  ...  324985539  326687501  328239523
1       Northeast   55317240   55380134  ...   56059240   56046620   55982803
2         Midwest   66927001   66974416  ...   68126781   68236628   68329004
3           South  114555744  114866680  ...  123542189  124569433  125580448
4            West   71945553   72100436  ...   77257329   77834820   78347268

[5 rows x 12 columns]

In [137]:
cen_data["Geographic Area"] = cen_data["Geographic Area"].str.strip('.')

In [138]:
# perform EDA Here

print(cen_data.columns)
print(tuber_data.columns)

Index(['Geographic Area', 'Census', '2010', '2011', '2012', '2013', '2014',
       '2015', '2016', '2017', '2018', '2019'],
      dtype='object')
Index(['States', 'TB_cases(2019)', 'TB_cases(2020)', 'TB_cases(2021)',
       'TB_inci(2019)', 'TB_inci(2020)', 'TB_inci(2021)', 'Total_Cases',
       'Total_incidence'],
      dtype='object')

<br/><br/>

---

# Join Data (Merge DataFrames)

Time to `merge`! Here I use the DataFrame method `df1.merge(right=df2, ...)` on DataFrame `df1` ([documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html)). Contrast this with the function `pd.merge(left=df1, right=df2, ...)` ([documentation](https://pandas.pydata.org/docs/reference/api/pandas.merge.html?highlight=pandas%20merge#pandas.merge)). Feel free to use either.

In [142]:
# merge TB dataframe with two US census dataframes
tb_census_df = (
    tuber_data
    .merge(right=cen_data,
           left_on="States", right_on="Geographic Area")
    .merge(right=cen_data,
           left_on="States", right_on="Geographic Area")
)

In [143]:
pd.set_option('display.max_columns',33)
tb_census_df

,States,TB_cases(2019),TB_cases(2020),TB_cases(2021),TB_inci(2019),TB_inci(2020),TB_inci(2021),Total_Cases,Total_incidence,Geographic Area,Census,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Alabama,87,72,92,1.77,1.43,1.83,251,5.03,Alabama,4779736,4785437,4799069,4815588,4830081,4841799,4852347,4863525,4874486,4887681,4903185
1,Alaska,58,58,58,7.91,7.92,7.92,174,23.75,Alaska,710231,713910,722128,730443,737068,736283,737498,741456,739700,735139,731545
2,Arizona,183,136,129,2.51,1.89,1.77,448,6.17,Arizona,6392017,6407172,6472643,6554978,6632764,6730413,6829676,6941072,7044008,7158024,7278717
3,Arkansas,64,59,69,2.12,1.96,2.28,192,6.36,Arkansas,2915918,2921964,2940667,2952164,2959400,2967392,2978048,2989918,3001345,3009733,3017804
4,California,2111,1706,1750,5.35,4.32,4.46,5567,14.13,California,37253956,37319502,37638369,37948800,38260787,38596972,38918045,39167117,39358497,39461588,39512223
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
46,Virginia,191,169,161,2.23,1.96,1.86,521,6.05,Virginia,8001024,8023699,8101155,8185080,8252427,8310993,8361808,8410106,8463587,8501286,8535519
47,Washington,221,163,199,2.90,2.11,2.57,583,7.58,Washington,6724540,6742830,6826627,6897058,6963985,7054655,7163657,7294771,7423362,7523869,7614893
48,West Virginia,9,13,7,0.50,0.73,0.39,29,1.62,West Virginia,1852994,1854239,1856301,1856872,1853914,1849489,1842050,1831023,1817004,1804291,1792147
49,Wisconsin,51,35,66,0.88,0.59,1.12,152,2.59,Wisconsin,5686986,5690475,5705288,5719960,5736754,5751525,5760940,5772628,5790186,5807406,5822434
50,Wyoming,1,0,3,0.17,0.00,0.52,4,0.69,Wyoming,563626,564487,567299,576305,582122,582531,585613,584215,578931,577601,578759

This is a little unwieldy. We could either drop the unneeded columns now, or just merge on smaller census DataFrames. Let's do the latter.


## Reproduce incidence

Let's recompute incidence to make sure we know where the original CDC numbers came from.

From the [CDC report](https://www.cdc.gov/mmwr/volumes/71/wr/mm7112a1.htm?s_cid=mm7112a1_w#T1_down): TB incidence is computed as “Cases per 100,000 persons using mid-year population estimates from the U.S. Census Bureau.”

If we define a group as 100,000 people, then we can compute the TB incidence for a given state population as

$$\text{TB incidence} = \frac{\text{# TB cases in population}}{\text{# groups in population}} = \frac{\text{# TB cases in population}}{\text{population}/100000} $$

$$= \frac{\text{# TB cases in population}}{\text{population}} \times 100000$$

Let's try this for 2019:

In [122]:
data["recompute incidence 2019"] = data["TB cases 2019"]/data["2019"]*100000
tb_census_df.head(5)

KeyError: 'TB cases 2019'

Awesome!!!

Let's use a for-loop and Python format strings to compute TB incidence for all years. Python f-strings are just used for the purposes of this demo, but they're handy to know when you explore data beyond this course ([Python documentation](https://docs.python.org/3/tutorial/inputoutput.html)).

In [ ]:
# recompute incidence for all years
for year in [2019, 2020, 2021]:
    tb_census_df[f"recompute incidence {year}"] = tb_census_df[f"TB cases {year}"]/tb_census_df[f"{year}"]*100000
tb_census_df.head(5)

These numbers look pretty close!!! There are a few errors in the hundredths place, particularly in 2021. It may be useful to further explore reasons behind this discrepancy. We'll leave it to you!

In [ ]:
tb_census_df.describe()